# 0차원=스칼라
# 1차원= 벡터
# 2차원= 행렬
# 3차원= 텐서Tensor

import numpy as np 

x1 = np.array([1,2,3])
print("x1= ",x1.shape) # x1= (3,) 스칼라가 3개란 뜻 벡터형태라 하위부분의 형태가 나옴

x2 = np.array([[1,2,3]])
print("x2= ",x2.shape) # x2=  (1, 3) 1행 3열이란 뜻 - x2가 행렬의 형태기 때문

x3 = np.array([[1,2,3],[4,5,6]])
print("x3= ",x3.shape) # x3=  (2, 3) 2행 3열이란 뜻 

x4 = np.array([[[1,2],[3,4],[5,6]],[[1,2],[5,4],[2,3]],[[2,3],[6,7],[4,3]]]) #x4=  (3, 3, 2) 작은거부터 오른쪽에 기재

print("x4= ",x4.shape)


x5 = np.array([[[[1]]],[[[2]]]]) #x5=  (2, 1, 1, 1)
print("x5= ",x5.shape) 

