import pandas as pd
print(pd.__version__)

data = [
    ['삼성', '1000', '2000'],
    ['현대', '1100', '3000'],
    ['LG', '2000', '500'],
    ['아모레', '3500', '6000'],
    ['네이버', '100', '15000']
]

index = ['031', '059', '033', '045', '023']
columns = ['종목명', '시가', '종가']

df = pd.DataFrame(data=data, index= index, columns=columns) #사용 데이터 / 인덱스 이름 / 컴럼 이름으로 행렬 생성
print(df)
print('-'*100)

#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!판다스는 열행!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
# print(df['종목명'])         #[열]
# print(df['시가']['045'])    #행렬X  열행O   #인덱스과 컬럼명을 지정하여 그에 맞는 인덱싱 필요

####################################################################################################################################
#loc : 인덱스 기준으로 행 데이터 추출
#ilic : 행번호 기준으로 행 데이터 추출
#       int loc로 외워
####################################################################################################################################
#print(df.iloc[3])       #index 번호로 행 요소 출력
#print(df.loc['045'])    #지정한 행 이름으로 행 요소 출력

# print(df.iloc[3,1])          #[][]가 아닌 [행,열]로 사용
# print(df.iloc[3]['종가'])      
# print(df.loc['045'].iloc[1])    
# print(df.iloc[1].loc['시가'])    
# print(df.loc['045']['시가'])   

#loc/iloc를 써도 뒤에 매서드 형태로 iloc/loc쓰기 가능 

